 Val_loss did not improve from: 0.9097031354904175 At epoch No.148 
Final Loss:0.6284522804475966 
Final accuracy:0.79761904 
Final val_accuracy:0.7604166865348816 
 Total epochs:150 
 Top 5:0.859375

 test loss and test acc:[0.42592543363571167, 0.859375]

Model: "LeNet"

_________________________________________________________________

Layer (type)                 Output Shape              Param #   

=================================================================

input_1 (InputLayer)         (None, 100, 100, 3)       0         

_________________________________________________________________

sub1 (AveragePooling2D)      (None, 50, 50, 3)         0         

_________________________________________________________________

conv1 (Conv2D)               (None, 48, 48, 16)        448       

_________________________________________________________________

sub2 (AveragePooling2D)      (None, 24, 24, 16)        0         

_________________________________________________________________

flatten_1 (Flatten)          (None, 9216)              0         

_________________________________________________________________

dense1 (Dense)               (None, 120)               1106040   

_________________________________________________________________

dense2 (Dense)               (None, 84)                10164     

_________________________________________________________________

output (Dense)               (None, 24)                2040      

=================================================================

Total params: 1,118,692

Trainable params: 1,118,692

Non-trainable params: 0

_________________________________________________________________